{
    "home.page-title": "Adrià Pulido Gonzalez - Programador de software",
    "home.page-description": "El portfoli personal d'Adrià Pulido - Mostro tot el meu treball, experiència acadèmica, habilitats i projectes que he desenvolupat com a programador de software fullstack.",
    "home.welcome": "Benvinguts al meu portfoli!",
    "nav.about-me": "Sobre mi",
    "nav.work-experience": "Experiència laboral",
    "nav.education": "Educació",
    "nav.projects": "Projectes",
    "nav.skills": "Habilitats",
    "nav.cv-networks": "CV i xarxes",
    "about-me.page-title": "Sobre mi - Adrià Pulido Gonzalez",
    "about-me.page-description": "El portfoli personal d'Adrià Pulido - Coneix qui sóc i a què em dedico.",
    "about-me.title": "Adrià Pulido Gonzalez",
    "about-me.subtitle": "5 anys d'experiència en el desenvolupament de software",
    "about-me.biography": "<p>Sóc Adrià Pulido Gonzalez, tot i que alguns amics també em coneixen com 'Adje'. La primera vegada que vaig programar va ser quan tenia 14 anys, utilitzant programes com Scratch i App Inventor per fer aplicacions molt senzilles. Des de llavors, el meu interès per la programació ha anat creixent, i durant els darrers 5 anys, m'he dedicat seriosament al desenvolupament de software, creant projectes innovadors i de gran utilitat, com ara AIssistant.</p><br/><p>Al llarg d'aquest temps, he treballat tant de manera professional com personal. A l'empresa SEIDOR, vaig aprendre i em vaig professionalitzar com a programador, destacant per automatitzar i millorar processos de producció de diverses empreses, que em van valorar molt positivament per la feina realitzada.</p><br/><p>Actualment, segueixo desenvolupant projectes web utilitzant les eines i tecnologies més modernes del mercat, integrant intel·ligència artificial, una tecnologia que considero clau per al futur.</p><br/><p>Com a desenvolupador amb experiència en el desenvolupament fullstack, sempre estic preparat per afrontar qualsevol repte, adaptant-me i buscant solucions innovadores.</p>",
    "work-experience.page-title": "Experiència laboral - Adrià Pulido Gonzalez",
    "work-experience.page-description": "El portfoli personal d'Adrià Pulido - Coneix la meva trajectòria laboral.",
    "work-experience.boyumit": "BoyumIT Solutions · Desenvolupadora de programari industrial, B2B",
    "work-experience.boyumit.role": "Desenvolupador mid per a SAP Business One",
    "work-experience.boyumit.period": "Gener 2025 – Present",
    "work-experience.boyumit.responsabilities": [
        "Desenvolupament i manteniment de noves funcionalitats en Beas Manufacturing, producte avançat de manufactura per a SAP Business One d’escriptori i web.",
        "Correcció de bugs, millora del rendiment i modernització de l’aplicació, utilitzant tecnologies web (JavaScript/TypeScript) i creant interfícies intuïtives per agilitzar la feina d’operaris industrials.",
        "Escalat i migració de funcionalitats existents a SAP Business One Web Client.",
        "Participació activa en decisions sobre l’evolució tècnica i funcional del producte."
    ],
    "work-experience.boyumit.achievements": [
        "Desenvolupament d’un dashboard de producció, que millora la visibilitat i accessibilitat de la producció en planta, optimitzant la feina diària dels operaris des del primer segon d’ús.",
        "Implementació de gràfics web visualment més clars i interactius, que mostren informació més detallada i comprensible, i que permeten executar tasques mitjançant accions integrades.",
        "Creació i integració d’un agent d’intel·ligència artificial capaç d’executar funcionalitats existents mitjançant instruccions escrites, agilitzant tasques i generació d’informes.",
        "Substitució de components obsolets limitats a 32 bits per components moderns basats en tecnologies web, millorant la compatibilitat i rendiment en qualsevol sistema."
    ],
    "work-experience.boyumit.training": "Coneixement avançat i demostrat en Beas Manufacturing, i desenvolupament de SAP Business One Web Client.",
    "work-experience.seidor": "SEIDOR · Consultora tecnològica, B2B",
    "work-experience.seidor.role": "Desenvolupador junior .NET per a SAP Business One",
    "work-experience.seidor.period": "Abril 2021 – Març 2024",
    "work-experience.seidor.responsabilities": [
        "Desenvolupament i millores d’add-ons personalitzats per a empreses, amb .NET per a SAP Business One, automatitzant processos per millorar l’eficiència i eficàcia de la feina dels clients.",
        "Gestió de bases de dades SQL relacionals, creant taules i camps que mantinguin la integritat i la relació de les dades.",
        "Col·laboració directa amb PIMES i grans empreses per identificar les seves necessitats i resoldre incidències."
    ],
    "work-experience.seidor.achievements": [
        "Contracte indefinit després de menys d’1 any de pràctiques, amb alt reconeixement per part de clients i equip.",
        "Reestructuració d’un dels add-ons més usats. Reducció del codi en un 50% i millora del rendiment en un 30%, corregint errors crítics i incorporant noves funcions."
    ],
    "work-experience.seidor.training": "Prevenció de riscos laborals, seguretat informàtica i idiomes.",
    "work-experience.responsabilities-title": "Responsabilitats",
    "work-experience.achievements-title": "Èxits assolits",
    "work-experience.training-title": "Formació",
    "projects.page-title": "Projectes - Adrià Pulido Gonzalez",
    "projects.page-description": "El portfoli personal d'Adrià Pulido - Descobreix els projectes que he realitzat i els que tinc previst fer.",
    "projects.aissistant": "AIssistant",
    "projects.aissistant.description": "AIssistant és un assistent virtual que implementa la intel·ligència artificial per realitzar diverses funcions. Aquesta aplicació web és una extensió del meu projecte anterior, GPT-Assistant, però està millor optimitzada, millor presentada i amb la intenció d'implementar més funcions útils per a la vida quotidiana de les persones en el futur.<br/><br/>Actualment, pots traduir textos a diversos idiomes, generar receptes de cuina i generar curiositats sobre un tema concret, a més d'una pregunta relacionada amb aquesta curiositat.<br/><br/>El projecte s'ha desenvolupat utilitzant Next.js per crear tant el front-end com el back-end. Per a la generació artificial de text, s'ha utilitzat Gemini API, mentre que per a la generació d'imatges es continua utilitzant OpenAI API.",
    "projects.aissistant.skills": [
        "HTML5",
        "CSS3",
        "TypeScript",
        "React.js",
        "Next.js",
        "OpenAI API",
        "Gemini API"
    ],
    "projects.entertaining-media": "Entertaining Media",
    "projects.entertaining-media.description": "Entertaining Media és un lloc web on pots cercar tot tipus de continguts per veure, llegir o jugar. El seu eslògan és \"Quina és la teva pròxima cosa per lluitar contra l'avorriment?\", perquè aquí pots trobar de tot per entretenir-te de diferents maneres. Tots els continguts mostrats en aquesta pàgina es recuperen de diferents APIs, com TMDB (per a pel·lícules), IGDB (per a jocs) i Google Books API.<br/><br/>Aquest projecte web s'ha creat amb Next.js i TypeScript. Es fa servir principalment el Server Side Rendering (SSR) en la majoria de components i s'adapta a qualsevol dispositiu mitjançant Responsive Design.",
    "projects.entertaining-media.skills": [
        "HTML5",
        "CSS3",
        "TypeScript",
        "Next.js"
    ],
    "projects.gpt-assistant": "GPT-assistant",
    "projects.gpt-assistant.description": "Vaig programar i dissenyar una pàgina web que integra la intel·ligència artificial d'OpenAI. A GPT-Assistant hi ha dues pàgines de mostreig que demostren exemples d'aplicació de l'API d'OpenAI: una tradueix textos a un altre idioma, i l'altra genera receptes segons els ingredients especificats.<br/><br/>El projecte s'ha desenvolupat en dues parts: La part front-end s'ha fet amb React i amb React-Router i TypeScript. La part  back-end s'ha utilitzat Node.js i Express.js per, a partir de peticions, retornar respostes estructurades i evitar respostes inesperades.",
    "projects.gpt-assistant.skills": [
        "HTML5",
        "CSS3",
        "JavaScript",
        "TypeScript",
        "React",
        "React Router",
        "Node.js",
        "Express.js",
        "OpenAI API",
        "Vitest",
        "Testing Library"
    ],
    "projects.notify": "Notify!",
    "projects.notify.description": "El meu primer projecte web va ser 'Notify!', una aplicació basada en una TO-DO List per poder prendre apunts i organitzar-los a la teva manera. També té un sistema d'autenticació per poder desar les teves notes al teu usuari.<br/><br/>El projecte està dividit en dues parts: El front-end està fet amb React i React Router, i el back-end s'ha realitzat amb Django REST Framework per a les sol·licituds i MySQL per desar el contingut de cada usuari.",
    "projects.notify.skills": [
        "HTML5",
        "SCSS",
        "JavaScript",
        "React.js",
        "React Router",
        "Python",
        "Django",
        "REST Framework",
        "MySQL",
        "PWA"
    ],
    "projects.repository": "Repositori de Github",
    "projects.webpage": "Pàgina web oficial",
    "projects.video-preview": "Vídeo de previsualització",
    "education.page-title": "Educació - Adrià Pulido Gonzalez",
    "education.page-description": "El portfoli personal d'Adrià Pulido - Coneix la meva formació acadèmica.",
    "education.tokio-school": "Tokio School",
    "education.tokio-school.course": "Titulació curs de programació en Python especialitzat en IA",
    "education.tokio-school.period": "Maig 2023 – Maig 2025",
    "education.tokio-school.competencies": [
        "Programació orientada a objectes en Python i preparació per al certificat oficial PCAP.",
        "Ús de llibreries per a Python com NumPy, Pandas i Flask.",
        "Entrenament de models supervisats, no supervisats i semi-supervisats amb Scikit-learn."
    ],
    "education.tokio-school.projects": [
        "<span class=\"uppercase font-semibold\">Projecte final de Python:</span> Pàgina web basada en una 'to-do list' amb un sistema bàsic d'autenticació d'usuaris, utilitzant React, Django i MySQL.",
        "<span class=\"uppercase font-semibold\">Projecte final de Machine Learning:</span> Diversos models especialitzats en classificar correus entrenats amb un conjunt de dades de spam utilitzant Regressió Logística, KNN, Arbres de Decisió Aleatoris i SVM."
    ],
    "education.uvic": "UVIC-UCC",
    "education.uvic.course": "Titulació del CFGS en Desenvolupament d’Aplicacions Multiplataforma",
    "education.uvic.period": "Septembre 2020 – Juny 2022",
    "education.uvic.competencies": [
        "Programació orientada a objectes en Java i consultes amb BBDD relacionals SQL.",
        "Programació amb llenguatges web com HTML5, CSS3, JavaScript/TypeScript i PHP.",
        "Programació amb altres llenguatges i tecnologies com Python, Android Studio, Git, .NET i Windows Server."
    ],
    "education.uvic.projects": [
        "<span class=\"uppercase font-semibold\">Projecte final:</span> Pàgina web basada en una xarxa social molt simplificada utilitzant Angular com a framework de front-end, Node.js amb Express.js per a l'API REST del back-end i MongoDB."
    ],
    "skills.page-title": "Habilitats - Adrià Pulido Gonzalez",
    "skills.page-description": "El portfoli personal d'Adrià Pulido - Descobreix les meves habilitats tècniques i personals.",
    "skills.technical-skills": "Habilitats tècniques",
    "skills.technical-skills.frontend-1-title": "Llenguatges front-end",
    "skills.technical-skills.frontend-1-description": "HTML5, CSS3 i JavaScript/TypeScript",
    "skills.technical-skills.frontend-2-title": "Frameworks i llibreries front-end",
    "skills.technical-skills.frontend-2-description": "Astro, React, React Router, Next.js i Angular",
    "skills.technical-skills.backend-title": "Frameworks i tecnologies back-end",
    "skills.technical-skills.backend-description": "Node.js, Django i Spring boot",
    "skills.technical-skills.dbs-title": "Bases de dades",
    "skills.technical-skills.dbs-description": "Microsoft SQL Server, MySQL i SAP Hana",
    "skills.technical-skills.net-title": "Llenguatges .NET",
    "skills.technical-skills.net-description": "C# i Visual Basic",
    "skills.technical-skills.erps-title": "ERPS",
    "skills.technical-skills.erps-description": "SAP Business One",
    "skills.technical-skills.python-title": "Llibreries de Python",
    "skills.technical-skills.python-description": "Python, Pandas, NumPy i Scikit-Learn",
    "skills.technical-skills.others-title": "Altres llenguatges i tecnologies",
    "skills.technical-skills.others-description": "Java, PHP, Android Studio i Windows Server",
    "skills.personal-skills": "Habilitats personals",
    "skills.personal-skills.items": [
        "Aprenentatge ràpid de llenguatges de programació i autodidacte.",
        "Creatiu, original i resolutiu.",
        "Treball en equip i molt bona relació amb els companys.",
        "Adaptació a qualsevol situació o problema",
        "Capacitat per aguantar certes tasques sota pressió",
        "Capacitat per continuar formant-me en qualsevol àmbit tecnològic i personal"
    ],
    "cv-networks.page-title": "CV i xarxes - Adrià Pulido Gonzalez",
    "cv-networks.page-description": "El portfoli personal d'Adrià Pulido - Explora les meves xarxes i contacta'm.",
    "cv-networks.download-cv": "Descarrega el meu CV aquí!",
    "cv-networks.links-title": "Les meves vies de contacte",
    "not-found.page-title": "Pàgina no trobada - Adrià Pulido Gonzalez",
    "not-found.page-description": "El portfoli personal d'Adrià Pulido - Aquesta pàgina era només un somni...",
    "not-found.message": "Aquesta pàgina era només un somni..."
}