{
    "home.page-title": "Portfoli - Adrià Pulido González",
    "home.page-description": "El portfoli personal d'Adrià Pulido - Mostro tot el meu treball, experiència acadèmica, habilitats i projectes que he desenvolupat com a programador de software fullstack.",
    "home.welcome": "Benvinguts al meu portfoli!",
    "nav.about-me": "Sobre mi",
    "nav.work-experience": "Experiència laboral",
    "nav.education": "Educació",
    "nav.projects": "Projectes",
    "nav.skills": "Habilitats",
    "nav.cv-networks": "CV i xarxes",
    "about-me.page-title": "Sobre mi - Adrià Pulido González",
    "about-me.page-description": "El portfoli personal d'Adrià Pulido - Coneix qui sóc i a què em dedico.",
    "about-me.title": "Adrià Pulido González",
    "about-me.subtitle": "5 anys d'experiència en el desenvolupament de software",
    "about-me.biography": "<p>Sóc <strong>Adrià Pulido González</strong>, tot i que alguns amics també em coneixen com 'Adje'. La primera vegada que vaig programar va ser quan tenia 14 anys, utilitzant programes com <strong>Scratch</strong> i <strong>App Inventor</strong> per fer aplicacions molt senzilles. Des de llavors, el meu interès per la <strong>programació</strong> ha anat creixent, i durant els darrers <strong>5 anys</strong>, m'he dedicat seriosament al <strong>desenvolupament de software</strong>, creant <strong>projectes innovadors</strong> i de <strong>gran utilitat</strong>, com ara <strong>AIssistant</strong>.</p><br/><p>Al llarg d'aquest temps, he treballat tant de manera professional com personal. A l'empresa <strong>SEIDOR</strong>, vaig aprendre i em vaig professionalitzar com a <strong>programador</strong>, destacant per <strong>automatitzar i millorar processos de producció</strong> de diverses empreses, que em van valorar molt positivament per la feina realitzada.</p><br/><p>Actualment, segueixo desenvolupant projectes web utilitzant les <strong>eines</strong> i <strong>tecnologies més modernes</strong> del mercat, integrant <strong>intel·ligència artificial</strong>, una tecnologia que considero clau per al futur.</p><br/><p>Com a desenvolupador amb experiència en el <strong>desenvolupament fullstack</strong>, sempre estic preparat per afrontar qualsevol repte, adaptant-me i buscant solucions innovadores.</p>",
    "work-experience.page-title": "Experiència laboral - Adrià Pulido González",
    "work-experience.page-description": "El portfoli personal d'Adrià Pulido - Coneix la meva trajectòria laboral.",
    "work-experience.seidor": "SEIDOR",
    "work-experience.seidor.role": "Programador fullstack en .NET per a SAP Business One",
    "work-experience.seidor.period": "04/2021 - 03/2024",
    "work-experience.seidor.responsabilities": [
        "Vaig desenvolupar nous complements (add-ons) i vaig realitzar millores dels ja existents per a <strong>SAP Business One</strong> amb <strong>.NET</strong> (<strong>Visual Basic</strong> i <strong>C#</strong>), automatitzant processos i creant formularis validats que van optimitzar considerablement els temps i l'eficiència de treball dels clients.",
        "Vaig gestionar bases de dades <strong>SQL</strong> (<strong>Microsoft Server SQL</strong> i <strong>SAP Hana</strong>), assegurant la integritat i la relació de les dades en crear taules i camps.",
        "Vaig col·laborar directament amb clients (pimes i grans empreses) per identificar necessitats i resoldre incidències."
    ],
    "work-experience.seidor.achievements": [
        "Després de començar com a estudiant en pràctiques, vaig obtenir un contracte indefinit en menys d'un any. Durant aquests <strong>3 anys</strong>, la meva feina ha estat <strong>altament valorada</strong> per clients, companys i supervisors.",
        "Vaig reestructurar el codi d'un dels complements més utilitzats de l'empresa, reduint la seva mida en un <strong>50%</strong> i millorant el temps de processament en un <strong>30%</strong>. Vaig corregir errors greus i vaig implementar noves funcionalitats necessàries reutilitzant codi existent."
    ],
    "work-experience.seidor.training": "Prevenció de riscos laborals, seguretat informàtica i idiomes.",
    "work-experience.responsabilities-title": "Responsabilitats",
    "work-experience.achievements-title": "Èxits aconseguits",
    "work-experience.training-title": "Formació",
    "projects.page-title": "Projectes - Adrià Pulido González",
    "projects.page-description": "El portfoli personal d'Adrià Pulido - Descobreix els projectes que he realitzat i els que tinc previst fer.",
    "projects.aissistant": "AIssistant",
    "projects.aissistant.description": "AIssistant és un assistent virtual que implementa la intel·ligència artificial per realitzar diverses funcions. Aquesta aplicació web és una extensió del meu projecte anterior, GPT-Assistant, però està millor optimitzada, millor presentada i amb la intenció d'implementar més funcions útils per a la vida quotidiana de les persones en el futur.<br/><br/>Actualment, pots traduir textos a diversos idiomes, generar receptes de cuina i generar curiositats sobre un tema concret, a més d'una pregunta relacionada amb aquesta curiositat.<br/><br/>El projecte s'ha desenvolupat utilitzant <strong>Next.js</strong> per crear tant el front-end com el back-end. Per a la generació artificial de text, s'ha utilitzat <strong>Gemini API</strong>, mentre que per a la generació d'imatges es continua utilitzant <strong>OpenAI API</strong>.",
    "projects.aissistant.skills": [
        "HTML5",
        "CSS3",
        "TypeScript",
        "React.js",
        "Next.js",
        "OpenAI API",
        "Gemini API"
    ],
    "projects.entertaining-media": "Entertaining Media",
    "projects.entertaining-media.description": "Entertaining Media és un lloc web on pots cercar tot tipus de continguts per veure, llegir o jugar. El seu eslògan és \"Quina és la teva pròxima cosa per lluitar contra l'avorriment?\", perquè aquí pots trobar de tot per entretenir-te de diferents maneres. Tots els continguts mostrats en aquesta pàgina es recuperen de diferents <strong>APIs</strong>, com TMDB (per a pel·lícules), IGDB (per a jocs) i Google Books API.<br/><br/>Aquest projecte web s'ha creat amb <strong>Next.js</strong> i <strong>TypeScript</strong>. Es fa servir principalment el <strong>Server Side Rendering (SSR)</strong> en la majoria de components i s'adapta a qualsevol dispositiu mitjançant <strong>Responsive Design</strong>.",
    "projects.entertaining-media.skills": [
        "HTML5",
        "CSS3",
        "TypeScript",
        "Next.js"
    ],
    "projects.gpt-assistant": "GPT-assistant",
    "projects.gpt-assistant.description": "Vaig programar i dissenyar una pàgina web que integra la intel·ligència artificial d'OpenAI. A GPT-Assistant hi ha dues pàgines de mostreig que demostren exemples d'aplicació de l'API d'OpenAI: una tradueix textos a un altre idioma, i l'altra genera receptes segons els ingredients especificats.<br/><br/>El projecte s'ha desenvolupat en dues parts: La part front-end s'ha fet amb <strong>React</strong> i amb <strong>React-Router</strong> i <strong>TypeScript</strong>. La part  back-end s'ha utilitzat <strong>Node.js</strong> i <strong>Express.js</strong> per, a partir de peticions, retornar respostes estructurades i evitar respostes inesperades.",
    "projects.gpt-assistant.skills": [
        "HTML5",
        "CSS3",
        "JavaScript",
        "TypeScript",
        "React",
        "React Router",
        "Node.js",
        "Express.js",
        "OpenAI API",
        "Vitest",
        "Testing Library"
    ],
    "projects.notify": "Notify!",
    "projects.notify.description": "El meu primer projecte web va ser 'Notify!', una aplicació basada en una TO-DO List per poder prendre apunts i organitzar-los a la teva manera. També té un sistema d'autenticació per poder desar les teves notes al teu usuari.<br/><br/>El projecte està dividit en dues parts: El front-end està fet amb <strong>React</strong> i <strong>React Router</strong>, i el back-end s'ha realitzat amb <strong>Django REST Framework</strong> per a les sol·licituds i <strong>MySQL</strong> per desar el contingut de cada usuari.",
    "projects.notify.skills": [
        "HTML5",
        "SCSS",
        "JavaScript",
        "React.js",
        "React Router",
        "Python",
        "Django",
        "REST Framework",
        "MySQL",
        "PWA"
    ],
    "projects.repository": "Repositori de Github",
    "projects.webpage": "Pàgina web oficial",
    "projects.video-preview": "Vídeo de previsualització",
    "education.page-title": "Educació - Adrià Pulido González",
    "education.page-description": "El portfoli personal d'Adrià Pulido - Coneix la meva formació acadèmica.",
    "education.tokio-school": "Tokio School",
    "education.tokio-school.course": "Curs de programació en Python i especialització en IA (ML i DL)",
    "education.tokio-school.period": "05/2023 - 05/2025",
    "education.tokio-school.competencies": [
        "Programació orientada a objectes en <strong>Python</strong> i preparació per al certificat oficial PCAP.",
        "Ús de llibreries per a Python com <strong>NumPy</strong>, <strong>Pandas</strong> i <strong>Flask</strong>.",
        "Entrenament de models supervisats, no supervisats i semi-supervisats amb <strong>Scikit-learn</strong>."
    ],
    "education.tokio-school.projects": [
        "<span class=\"uppercase font-semibold\">Projecte final de Python:</span> Pàgina web basada en una 'to-do list' amb un sistema bàsic d'autenticació d'usuaris, utilitzant <strong>React</strong>, <strong>Django</strong> i <strong>MySQL</strong>.",
        "<span class=\"uppercase font-semibold\">Projecte final de Machine Learning:</span> Diversos models especialitzats en classificar correus entrenats amb un conjunt de dades de spam utilitzant <strong>Regressió Logística</strong>, <strong>KNN</strong>, <strong>Arbres de Decisió Aleatoris</strong> i <strong>SVM</strong>."
    ],
    "education.uvic": "UVIC-UCC Teknós",
    "education.uvic.course": "CFGS en Desenvolupament d'Aplicacions Multiplataforma",
    "education.uvic.period": "09/2020 - 06/2022",
    "education.uvic.competencies": [
        "Programació orientada a objectes en <strong>Java</strong> i consultes amb BBDD relacionals <strong>SQL</strong>.",
        "Programació amb llenguatges web com <strong>HTML5</strong>, <strong>CSS3</strong>, <strong>JavaScript/TypeScript</strong> i <strong>PHP</strong>.",
        "Programació amb altres llenguatges i tecnologies com <strong>Python</strong>, <strong>Android Studio</strong>, <strong>Git</strong>, <strong>.NET</strong> i <strong>Windows Server</strong>."
    ],
    "education.uvic.projects": [
        "<span class=\"uppercase font-semibold\">Projecte final de CFGS:</span> Pàgina web basada en una xarxa social molt simplificada utilitzant <strong>Angular</strong> com a framework de front-end, <strong>Node.js</strong> amb <strong>Express.js</strong> per a l'API REST del back-end i <strong>MongoDB</strong>."
    ],
    "skills.page-title": "Habilitats - Adrià Pulido González",
    "skills.page-description": "El portfoli personal d'Adrià Pulido - Descobreix les meves habilitats tècniques i personals.",
    "skills.technical-skills": "Habilitats tècniques",
    "skills.technical-skills.frontend-1-title": "Llenguatges front-end",
    "skills.technical-skills.frontend-1-description": "HTML5, CSS3 i JavaScript/TypeScript",
    "skills.technical-skills.frontend-2-title": "Frameworks i llibreries front-end",
    "skills.technical-skills.frontend-2-description": "Astro, React, React Router, Next.js i Angular",
    "skills.technical-skills.backend-title": "Frameworks i tecnologies back-end",
    "skills.technical-skills.backend-description": "Node.js, Django i Spring boot",
    "skills.technical-skills.dbs-title": "Bases de dades",
    "skills.technical-skills.dbs-description": "Microsoft SQL Server, MySQL i SAP Hana",
    "skills.technical-skills.net-title": "Llenguatges .NET",
    "skills.technical-skills.net-description": "C# i Visual Basic",
    "skills.technical-skills.erps-title": "ERPS",
    "skills.technical-skills.erps-description": "SAP Business One",
    "skills.technical-skills.python-title": "Llibreries de Python",
    "skills.technical-skills.python-description": "Python, Pandas, NumPy i Scikit-Learn",
    "skills.technical-skills.others-title": "Altres llenguatges i tecnologies",
    "skills.technical-skills.others-description": "Java, PHP, Android Studio i Windows Server",
    "skills.personal-skills": "Habilitats personals",
    "skills.personal-skills.items": [
        "Aprenentatge ràpid de llenguatges de programació i autodidacte.",
        "Creatiu, original i resolutiu.",
        "Treball en equip i molt bona relació amb els companys.",
        "Adaptació a qualsevol situació o problema",
        "Capacitat per aguantar certes tasques sota pressió",
        "Capacitat per continuar formant-me en qualsevol àmbit tecnològic i personal"
    ],
    "cv-networks.page-title": "CV i xarxes - Adrià Pulido González",
    "cv-networks.page-description": "El portfoli personal d'Adrià Pulido - Explora les meves xarxes i contacta'm.",
    "cv-networks.download-cv": "Descarrega el meu CV aquí!",
    "cv-networks.links-title": "Les meves vies de contacte",
    "not-found.page-title": "Pàgina no trobada - Adrià Pulido González",
    "not-found.page-description": "El portfoli personal d'Adrià Pulido - Aquesta pàgina era només un somni...",
    "not-found.message": "Aquesta pàgina era només un somni..."
}