{
    "home.page-title": "Adrià Pulido Gonzalez - Software developer",
    "home.page-description": "Adrià Pulido's personal portfolio - Showcasing all my work, academic experience, skills, and projects I have developed as fullstack software developer.",
    "home.welcome": "Welcome to my portfolio!",
    "nav.about-me": "About me",
    "nav.work-experience": "Work experience",
    "nav.education": "Education",
    "nav.projects": "Projects",
    "nav.skills": "Skills",
    "nav.cv-networks": "CV & networks",
    "about-me.page-title": "About me - Adrià Pulido Gonzalez",
    "about-me.page-description": "Adrià Pulido's personal portfolio - Get to know who I am and what I do.",
    "about-me.title": "Adrià Pulido Gonzalez",
    "about-me.subtitle": "5-year experienced in software development",
    "about-me.biography": "<p>I am Adrià Pulido Gonzalez, though some friends know me as well as 'Adje'. The first time I programmed was when I was 14 years old, using programs like Scratch and App Inventor to create very simple applications. Since then, my interest in programming has grown, and for the last 5 years, I have been seriously dedicated to software development, creating innovative and highly useful projects, such as AIssistant.</p><br/><p>During this time, I have worked both professionally and personally. At SEIDOR, I learned and became professional as a programmer, standing out for automating and improving production processes for several companies, which highly valued my work.</p><br/><p>Currently, I continue to develop web projects using the latest tools and technologies in the market, integrating artificial intelligence, a technology I consider key for the future.</p><br/><p>As a developer with experience in fullstack development, I am always ready to face any challenge, adapting and seeking innovative solutions.</p>",
    "work-experience.page-title": "Work experience - Adrià Pulido Gonzalez",
    "work-experience.page-description": "Adrià Pulido's personal portfolio - Learn about my work experience.",
    "work-experience.boyumit": "BoyumIT Solutions · Industrial software developer, B2B ",
    "work-experience.boyumit.role": "Mid-level developer for SAP Business One",
    "work-experience.boyumit.period": "January 2025 – Present",
    "work-experience.boyumit.responsabilities": [
        "Develop and maintain new features in Beas Manufacturing, an advanced manufacturing product for SAP Business One desktop and web.",
        "Fix bugs, improve performance, and modernize the application using web technologies (JavaScript/TypeScript), designing intuitive interfaces to make industrial operators' work easier.",
        "Scale and migrate existing features to the SAP Business One Web Client.",
        "Actively contribute to technical and functional decisions regarding product evolution."
    ],
    "work-experience.boyumit.achievements": [
        "Develop a production dashboard that improves visibility and accessibility on the shop floor, optimizing operators' daily work from the very first use.",
        "Implement clearer and more interactive web-based charts that display more detailed and understandable information, with integrated action capabilities.",
        "Create and integrate an AI agent capable of executing existing features through written instructions, speeding up tasks and report generation.",
        "Replace obsolete 32-bit-only components with modern web-based ones, improving compatibility and performance across systems."
    ],
    "work-experience.boyumit.training": "Advanced and proven knowledge of Beas Manufacturing, and SAP Business One Web Client development.",
    "work-experience.seidor": "SEIDOR · Tech consultancy, B2B",
    "work-experience.seidor.role": "Junior .NET developer for SAP Business One",
    "work-experience.seidor.period": "April 2021 – March 2024",
    "work-experience.seidor.responsabilities": [
        "Develop and modify custom add-ons using .NET for SAP Business One, automating processes to improve client efficiency and effectiveness.",
        "Manage relational SQL databases, creating tables and fields while maintaining data integrity and relationships.",
        "Collaborate directly with SMEs and large companies to identify needs and solve incidents."
    ],
    "work-experience.seidor.achievements": [
        "Offered a permanent contract in less than 1 year of internship, with strong recognition from both clients and the team.",
        "Restructure one of the most widely used add-ons: reduced codebase by 50% and improved performance by 30%, fixing critical bugs and adding new functionalities."
    ],
    "work-experience.seidor.training": "Occupational risk prevention, IT security, and language skills.",
    "work-experience.responsabilities-title": "Responsibilities",
    "work-experience.achievements-title": "Achievements",
    "work-experience.training-title": "Training",
    "projects.page-title": "Projects - Adrià Pulido Gonzalez",
    "projects.page-description": "Adrià Pulido's personal portfolio - Discover the projects I have completed and the ones I plan to undertake.",
    "projects.aissistant": "AIssistant",
    "projects.aissistant.description": "AIssistant is a virtual assistant that implements artificial intelligence to perform various functions. This web app is an extension of my previous project, GPT-Assistant, but it's better optimized, better presented, and with the intention of gradually implementing more useful features for people's daily lives in the future.<br/><br/>Currently, you can translate texts into various languages, generate cooking recipes, and obtain curiosities about specific topics, along with a question related to that curiosity.<br/><br/>The project has been developed using Next.js to create both the front-end and back-end. For artificial text generation, Gemini API has been used, while OpenAI API is still being used for creating images.",
    "projects.aissistant.skills": [
        "HTML5",
        "CSS3",
        "TypeScript",
        "React.js",
        "Next.js",
        "OpenAI API",
        "Gemini API"
    ],
    "projects.entertaining-media": "Entertaining Media",
    "projects.entertaining-media.description": "Entertaining Media is a website where you can search all kind of contents to watch, read or play. Its slogan is \"What's your next thing to fight against boredom?\", because in here you can find everything to get entertained in different ways. All the contents shown in this page are fetched from different APIs, such as TMDB (for movies), IGDB (for games) and Google Books API.<br/><br/>This web project was created with Next.js and TypeScript. Server Side Rendering (SSR) is mainly used in most components and it adapts to any device through Responsive Design.",
    "projects.entertaining-media.skills": [
        "HTML5",
        "CSS3",
        "TypeScript",
        "Next.js"
    ],
    "projects.gpt-assistant": "GPT-assistant",
    "projects.gpt-assistant.description": "I programmed and designed a webpage that integrates OpenAI's artificial intelligence. In GPT-Assistant, there are two sample pages demonstrating examples of the OpenAI API application: one translates texts into another language, and the other generates recipes based on specified ingredients.<br/><br/>The project has been developed in two parts: The front-end part is done in React and with React-Router and TypeScript. The back-end part uses Node.js and Express.js to return structured responses from requests and avoid unexpected responses.",
    "projects.gpt-assistant.skills": [
        "HTML5",
        "CSS3",
        "JavaScript",
        "TypeScript",
        "React",
        "React Router",
        "Node.js",
        "Express.js",
        "OpenAI API",
        "Vitest",
        "Testing Library"
    ],
    "projects.notify": "Notify!",
    "projects.notify.description": "My first web project was 'Notify!', an application based on a TO-DO List to take notes and organize them yourself. It also has an authentication system to save your notes in your user account.<br/><br/>The project is divided into two parts: The front-end is built with React and React Router, and the back-end is developed using Django REST Framework for requests and MySQL to store each user's content.",
    "projects.notify.skills": [
        "HTML5",
        "SCSS",
        "JavaScript",
        "React.js",
        "React Router",
        "Python",
        "Django",
        "REST Framework",
        "MySQL",
        "PWA"
    ],
    "projects.repository": "Github repository",
    "projects.webpage": "Official webpage",
    "projects.video-preview": "Preview video",
    "education.page-title": "Education - Adrià Pulido Gonzalez",
    "education.page-description": "Adrià Pulido's personal portfolio - Learn about my academic background.",
    "education.tokio-school": "Tokio School",
    "education.tokio-school.course": "Certification in Python programming specialized in AI",
    "education.tokio-school.period": "May 2023 – May 2025",
    "education.tokio-school.competencies": [
        "Object-oriented programming in Python and preparation for the official PCAP certificate.",
        "Use of libraries for Python such as NumPy, Pandas and Flask.",
        "Training of supervised, unsupervised, and semi-supervised models with Scikit."
    ],
    "education.tokio-school.projects": [
        "<span class=\"uppercase font-semibold\">Python final project:</span> Web page based on a 'to-do list' with a basic user authentication system, using React, Django and MySQL.",
        "<span class=\"uppercase font-semibold\">Machine Learning final project:</span> Several models specialized in classifing mails trained by a spam dataset with Logistic Regression, KNN, Random Forests and SVM."
    ],
    "education.uvic": "UVIC-UCC",
    "education.uvic.course": "Advanced Vocational Degree (CFGS) in Multi-platform Application Development",
    "education.uvic.period": "September 2020 – June 2022",
    "education.uvic.competencies": [
        "Object-oriented programming in Java and queries with relational SQL databases.",
        "Web programming with languages like HTML5, CSS3, JavaScript/TypeScript and PHP.",
        "Programming with other languages and technologies like Python, Android Studio, Git, .NET and Windows Server."
    ],
    "education.uvic.projects": [
        "<span class=\"uppercase font-semibold\">Final project:</span> Web page based on a very simplified social network using Angular as a front-end framework, Node.js with Express.js for the API REST back-end and MongoDB."
    ],
    "skills.page-title": "Skills - Adrià Pulido Gonzalez",
    "skills.page-description": "Adrià Pulido's personal portfolio - Discover my technical and personal skills.",
    "skills.technical-skills": "Technical skills",
    "skills.technical-skills.frontend-1-title": "Front-end languages",
    "skills.technical-skills.frontend-1-description": "HTML5, CSS3 & JavaScript/TypeScript",
    "skills.technical-skills.frontend-2-title": "Front-end frameworks & libraries",
    "skills.technical-skills.frontend-2-description": "Astro, React, React Router, Next.js & Angular",
    "skills.technical-skills.backend-title": "Back-end frameworks & technologies",
    "skills.technical-skills.backend-description": "Node.js, Django & Spring boot",
    "skills.technical-skills.dbs-title": "Databases",
    "skills.technical-skills.dbs-description": "Microsoft SQL Server, MySQL & SAP Hana",
    "skills.technical-skills.net-title": ".NET Languages",
    "skills.technical-skills.net-description": "C# & Visual Basic",
    "skills.technical-skills.erps-title": "ERPS",
    "skills.technical-skills.erps-description": "SAP Business One",
    "skills.technical-skills.python-title": "Python libraries",
    "skills.technical-skills.python-description": "Python, Pandas, NumPy & Scikit-Learn",
    "skills.technical-skills.others-title": "Other languages & technologies",
    "skills.technical-skills.others-description": "Java, PHP, Android Studio & Windows Server",
    "skills.personal-skills": "Personal skills",
    "skills.personal-skills.items": [
        "Quick learning of programming languages and self-taught.",
        "Creative, original and resourceful.",
        "Teamwork and very good relationship with colleagues.",
        "Adaptation to any situation or problem",
        "Ability to handle certain tasks under pressure",
        "Ability to keep learning in any technological and personal field"
    ],
    "cv-networks.page-title": "CV & networks - Adrià Pulido Gonzalez",
    "cv-networks.page-description": "Adrià Pulido's personal portfolio - Explore my networks and contact me.",
    "cv-networks.download-cv": "Download my CV here!",
    "cv-networks.links-title": "My contact methods",
    "not-found.page-title": "Page Not Found - Adrià Pulido Gonzalez",
    "not-found.page-description": "Adrià Pulido's personal portfolio - This page was just a dream...",
    "not-found.message": "This page was just a dream..."
}