{
    "home.page-title": "Adrià Pulido Gonzalez - Desarrollador de software",
    "home.page-description": "El portafolio personal de Adrià Pulido - Muestro todo mi trabajo, experiencia académica, habilidades y proyectos que he desarrollado como programador de software fullstack.",
    "home.welcome": "¡Bienvenidos a mi portafolio!",
    "nav.about-me": "Sobre mí",
    "nav.work-experience": "Experiencia laboral",
    "nav.education": "Educación",
    "nav.projects": "Proyectos",
    "nav.skills": "Habilidades",
    "nav.cv-networks": "CV y redes",
    "about-me.page-title": "Sobre mí - Adrià Pulido Gonzalez",
    "about-me.page-description": "El portafolio personal de Adrià Pulido - Conoce quién soy y a qué me dedico.",
    "about-me.title": "Adrià Pulido Gonzalez",
    "about-me.subtitle": "5 años de experiencia en el desarrollo de software",
    "about-me.biography": "<p>Soy Adrià Pulido Gonzalez, aunque algunos amigos también me conocen como 'Adje'. La primera vez que programé fue cuando tenía 14 años, utilizando programas como Scratch y App Inventor para hacer aplicaciones muy simples. Desde entonces, mi interés en la programación fue creciendo, y durante los últimos 5 años, me he dedicado seriamente al desarrollo de software, creando proyectos innovadores y de gran utilidad, como AIssistant.</p><br/><p>A lo largo de este tiempo, he trabajado tanto de manera profesional como personal. En la empresa SEIDOR, aprendí y me profesionalicé como programador, destacando por automatizar y mejorar procesos de producción de varias empresas, quienes me valoraron muy positivamente por el trabajo realizado.</p><br/><p>Actualmente, sigo desarrollando proyectos web utilizando las herramientas y tecnologías más novedosas del mercado, integrando inteligencia artificial, una tecnología que considero clave para el futuro.</p><br/><p>Como desarrollador con experiencia en el desarrollo fullstack, siempre me preparo para enfrentar cualquier desafío, adaptándome y buscando soluciones innovadoras.</p>",
    "work-experience.page-title": "Experiencia laboral - Adrià Pulido Gonzalez",
    "work-experience.page-description": "El portafolio personal de Adrià Pulido - Conoce mi trayectoria laboral.",
    "work-experience.boyumit": "BoyumIT Solutions · Desarrolladora de software industrial, B2B",
    "work-experience.boyumit.role": "Desarrollador mid para SAP Business One",
    "work-experience.boyumit.period": "Enero 2025 – Presente",
    "work-experience.boyumit.responsabilities": [
        "Desarrollo y mantenimiento de nuevas funcionalidades en Beas Manufacturing, producto avanzado de manufactura para SAP Business One de escritorio y web.",
        "Corrección de bugs, mejora del rendimiento y modernización de la aplicación, utilizando tecnologías web (JavaScript/TypeScript) y creando interfaces intuitivas para agilizar el trabajo de operarios industriales.",
        "Escalado y migración de funcionalidades existentes a SAP Business One Web Client.",
        "Participación activa en decisiones sobre la evolución técnica y funcional del producto."
    ],
    "work-experience.boyumit.achievements": [
        "Desarrollo de un dashboard de producción, que mejora la visibilidad y accesibilidad de la producción en planta, optimizando el trabajo diario de los operarios desde el primer segundo de uso.",
        "Implementación de gráficos web visualmente más claros e interactivos, que muestran información más detallada y comprensible, y que permiten ejecutar tareas mediante acciones integradas.",
        "Creación e integración de un agente de inteligencia artificial capaz de ejecutar funcionalidades existentes mediante instrucciones escritas, agilizando tareas y generación de reportes.",
        "Substitución de componentes obsoletos limitados a 32 bits por componentes modernos basados en tecnologías web, mejorando la compatibilidad y rendimiento en cualquier sistema."
    ],
    "work-experience.boyumit.training": "Conocimiento avanzado y demostrado en Beas Manufacturing, y desarrollo de SAP Business One Web Client.",
    "work-experience.seidor": "SEIDOR · Consultora tecnológica, B2B",
    "work-experience.seidor.role": "Desarrollador junior .NET para SAP Business One",
    "work-experience.seidor.period": "Abril 2021 – Marzo 2024",
    "work-experience.seidor.responsabilities": [
        "Desarrollo y mejoras de add-ons personalizados para empresas, con .NET para SAP Business One, automatizando procesos para mejorar la eficiencia y eficacia del trabajo de los clientes.",
        "Gestión de bases de datos SQL relacionales, creando tablas y campos que mantengan la integridad y la relación de los datos.",
        "Colaboración directa con PYMES y grandes empresas para identificar sus necesidades y resolver incidencias."
    ],
    "work-experience.seidor.achievements": [
        "Contrato indefinido tras menos de 1 año de prácticas, con alto reconocimiento por parte de clientes y equipo.",
        "Reestructuración de uno de los add-ons más usados. Reducción del código en un 50% y mejora del rendimiento en un 30%, corrigiendo errores críticos e incorporando nuevas funciones."
    ],
    "work-experience.seidor.training": "Prevención de riesgos laborales, seguridad informática e idiomas.",
    "work-experience.responsabilities-title": "Responsabilidades",
    "work-experience.achievements-title": "Logros conseguidos",
    "work-experience.training-title": "Formación",
    "projects.page-title": "Proyectos - Adrià Pulido Gonzalez",
    "projects.page-description": "El portafolio personal de Adrià Pulido - Descubre los proyectos que he realizado y los que voy a hacer.",
    "projects.aissistant": "AIssistant",
    "projects.aissistant.description": "AIssistant es un asistente virtual que implementa la inteligencia artificial para realizar diversas funciones. Esta app web es una extensión de mi proyecto anterior, GPT-Assistant, pero está mejor optimizada, mejor presentada, y con la intención de ir implementando más funciones útiles para la vida cotidiana de las personas en el futuro.<br/><br/>Actualmente, puedes traducir textos en varios idiomas, generar recetas de cocina y obtener curiosidades sobre un tema en concreto, además de una pregunta relacionada con esa curiosidad.<br/><br/>El proyecto se ha desarrollado utilizando Next.js para crear el front-end y el back-end. Para la generación artificial de texto, se ha utilizado Gemini API, mientras que para la generación de imágenes, se sigue empleando OpenAI API.",
    "projects.aissistant.skills": [
        "HTML5",
        "CSS3",
        "TypeScript",
        "React.js",
        "Next.js",
        "OpenAI API",
        "Gemini API"
    ],
    "projects.entertaining-media": "Entertaining Media",
    "projects.entertaining-media.description": "Entertaining Media es un sitio web donde puedes buscar todo tipo de contenidos para ver, leer o jugar. Su eslogan es \"¿Cuál es tu próxima cosa para luchar contra el aburrimiento?\", porque aquí puedes encontrar de todo para entretenerte de diferentes maneras. Todos los contenidos mostrados en esta página se obtienen de diferentes APIs, como TMDB (para películas), IGDB (para juegos) y Google Books API.<br/><br/>Este proyecto web se ha creado con Next.js y TypeScript. Se utiliza principalmente el Server Side Rendering (SSR) en la mayoría de componentes y se adapta a cualquier dispositivo mediante Responsive Design.",
    "projects.entertaining-media.skills": [
        "HTML5",
        "CSS3",
        "TypeScript",
        "Next.js"
    ],
    "projects.gpt-assistant": "GPT-assistant",
    "projects.gpt-assistant.description": "Programé y diseñé una página web que integra la inteligencia artificial de OpenAI. En GPT-Assistant hay dos páginas de muestreo que demuestran ejemplos de aplicación de la API de OpenAI: una traduce textos a otro idioma, y la otra genera recetas según los ingredientes especificados.<br/><br/>El proyecto se ha desarrollado en dos partes: La parte del front-end está hecha con React y con React-Router y TypeScript. La parte del back-end se ha utilizado Node.js y Express.js para, a partir de peticiones, devolver respuestas estructuradas y evitar respuestas inesperadas.",
    "projects.gpt-assistant.skills": [
        "HTML5",
        "CSS3",
        "JavaScript",
        "TypeScript",
        "React",
        "React Router",
        "Node.js",
        "Express.js",
        "OpenAI API",
        "Vitest",
        "Testing Library"
    ],
    "projects.notify": "Notify!",
    "projects.notify.description": "Mi primer proyecto web fue 'Notify!', una aplicación basada en una TO-DO List para poder tener apuntes y poderlos organizar a tu manera. También tiene un sistema de autenticación para poder guardar tus notas en tu usuario.<br/><br/>El proyecto está dividido en dos partes: El front-end está hecho con React y React Router y el back-end se ha realizado con Django REST Framework para las solicitudes y MySQL para guardar el contenido de cada usuario.",
    "projects.notify.skills": [
        "HTML5",
        "SCSS",
        "JavaScript",
        "React.js",
        "React Router",
        "Python",
        "Django",
        "REST Framework",
        "MySQL",
        "PWA"
    ],
    "projects.repository": "Repositorio de Github",
    "projects.webpage": "Página web oficial",
    "projects.video-preview": "Vídeo de previsualización",
    "education.page-title": "Educación - Adrià Pulido Gonzalez",
    "education.page-description": "El portafolio personal de Adrià Pulido - Conoce mi formación académica.",
    "education.tokio-school": "Tokio School",
    "education.tokio-school.course": "Titulación curso de programación en Python especializado en IA",
    "education.tokio-school.period": "Mayo 2023 – Mayo 2025",
    "education.tokio-school.competencies": [
        "Programación orientada a objetos en Python y preparación para el certificado oficial PCAP.",
        "Uso de librerías para Python como NumPy, Pandas y Flask.",
        "Entrenamiento de modelos supervisados, no supervisados y semi-supervisados con Scikit-learn."
    ],
    "education.tokio-school.projects": [
        "<span class=\"uppercase font-semibold\">Proyecto final de python:</span> Página web basada en una 'to-do list' con un sistema básico de autenticación de usuarios, utilizando React, Django y MySQL.",
        "<span class=\"uppercase font-semibold\">Proyecto final de Machine Learning:</span> Varios modelos especializados en clasificar correos entrenados con un conjunto de datos de spam utilizando Regresión Logística, KNN, Árboles de Decisión Aleatorios y SVM"
    ],
    "education.uvic": "UVIC-UCC",
    "education.uvic.course": "Titulación del CFGS en Desarrollo de Aplicaciones Multiplataforma",
    "education.uvic.period": "Septiembre 2020 – Junio 2022",
    "education.uvic.competencies": [
        "Programación orientada a objetos en Java y consultas con BBDD relacionales SQL.",
        "Programación con lenguajes web como HTML5, CSS3, JavaScript/TypeScript y PHP.",
        "Programación con otros lenguajes y tecnologías como Python, Android Studio, Git, .NET y Windows Server."
    ],
    "education.uvic.projects": [
        "<span class=\"uppercase font-semibold\">Proyecto final:</span> Página web basada en una red social muy simplificada utilizando Angular como framework de front-end, Node.js con Express.js para el back-end de API REST y MongoDB."
    ],
    "skills.page-title": "Habilidades - Adrià Pulido Gonzalez",
    "skills.page-description": "El portafolio personal de Adrià Pulido - Descubre mis habilidades técnicas y personales.",
    "skills.technical-skills": "Habilidades técnicas",
    "skills.technical-skills.frontend-1-title": "Lenguajes front-end",
    "skills.technical-skills.frontend-1-description": "HTML5, CSS3 y JavaScript/TypeScript",
    "skills.technical-skills.frontend-2-title": "Frameworks y librerías front-end",
    "skills.technical-skills.frontend-2-description": "Astro, React, React Router, Next.js y Angular",
    "skills.technical-skills.backend-title": "Frameworks y tecnologías back-end",
    "skills.technical-skills.backend-description": "Node.js, Django y Spring boot",
    "skills.technical-skills.dbs-title": "Bases de datos",
    "skills.technical-skills.dbs-description": "Microsoft SQL Server, MySQL y SAP Hana",
    "skills.technical-skills.net-title": "Lenguajes .NET",
    "skills.technical-skills.net-description": "C# y Visual Basic",
    "skills.technical-skills.erps-title": "ERPS",
    "skills.technical-skills.erps-description": "SAP Business One",
    "skills.technical-skills.python-title": "Librerías de Python",
    "skills.technical-skills.python-description": "Python, Pandas, NumPy y Scikit-Learn",
    "skills.technical-skills.others-title": "Otros lenguajes y tecnologías",
    "skills.technical-skills.others-description": "Java, PHP, Android Studio y Windows Server",
    "skills.personal-skills": "Habilidades personales",
    "skills.personal-skills.items": [
        "Aprendizaje rápido de lenguajes de programación y autodidácta.",
        "Creativo, original y resolutivo.",
        "Trabajo en equipo y relación muy buena con los compañeros.",
        "Adaptación a cualquier situación o problema",
        "Capacidad para aguantar ciertas tareas bajo presión",
        "Capacidad para seguir formándome en cualquier ámbito tecnológico y personal"
    ],
    "cv-networks.page-title": "CV y redes - Adrià Pulido Gonzalez",
    "cv-networks.page-description": "El portafolio personal de Adrià Pulido - Explora mis redes y contáctame.",
    "cv-networks.download-cv": "¡Descarga mi CV aquí!",
    "cv-networks.links-title": "Mis vías de contacto",
    "not-found.page-title": "Página no encontrada - Adrià Pulido Gonzalez",
    "not-found.page-description": "El portafolio personal de Adrià Pulido - Esta página era solo un sueño...",
    "not-found.message": "Esta página era solo un sueño..."
}